data/perf/merge-timing-afe47a2a75a5/mysql/tsan-sound/run4/oltp_read_write.txt
Sysbench script: /usr/share/sysbench/oltp_read_write.lua
sysbench /usr/share/sysbench/oltp_read_write.lua --mysql-user=root --mysql-socket=/tmp/mysql.sock  --threads=18 --time=180 --rand-type=special run | awk '/Latency \(ms\):/ { exit; } 1'
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 18
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            100030
        write:                           28563
        other:                           14283
        total:                           142876
    transactions:                        7138   (39.58 per sec.)
    queries:                             142876 (792.24 per sec.)
    ignored errors:                      7      (0.04 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          180.3410s
    total number of events:              7138

MySQL build: ..